package boj;

import java.io.*;

public class BOJ2525 {
    public void solve() throws IOException {
        // 📝 문제 설명
        /*
         * 문제:
         * KOI 전자에서는 건강에 좋고 맛있는 훈제요리기구 요리를 간편하게 만드는 인공지능 오븐을 개발하려고 한다.
         * 인공지능 오븐을 사용하는 방법은 적당한 양의 요리 훈제 재료를 인공지능 오븐에 넣으면 된다.
         * 그러면 인공지능 오븐은 오븐구이가 끝나는 시간을 본 단위로 자동적으로 계산한다.
         * 
         * 또한, KOI 전자의 인공지능 오븐 앞면에는 사용자에게 훈제요리기구 요리가 끝나는 시각을 알려 주는 디지털 시계가 있다.
         * 
         * 훈제요리기구를 시작하는 시각과 오븐구이를 하는 데 필요한 시간이 분단위로 주어졌을 때, 
         * 오븐구이가 끝나는 시각을 계산하는 프로그램을 작성하시오.
         * 
         * 입력:
         * 첫째 줄에는 현재 시각이 나온다. 현재 시각은 시 A (0 ≤ A ≤ 23) 와 분 B (0 ≤ B ≤ 59)가 정수로 빈칸을 사이에 두고 순서대로 주어진다.
         * 두 번째 줄에는 요리하는 데 필요한 시간 C (0 ≤ C ≤ 1,000)가 분 단위로 주어진다.
         * 
         * 출력:
         * 첫째 줄에 종료되는 시각의 시와 분을 공백을 사이에 두고 출력한다. 
         * (단, 시는 0부터 23까지의 정수, 분은 0부터 59까지의 정수이다. 디지털 시계는 23시 59분에서 1분이 지나면 0시 0분이 된다.)
         */

        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        StringBuilder sb = new StringBuilder();

        String input[] = br.readLine().split(" ");
        int A = Integer.parseInt(input[0]); // 현재 시각의 시
        int B = Integer.parseInt(input[1]); // 현재 시각의 분
        int C = Integer.parseInt(br.readLine()); // 요리하는 데 필요한 시간

        A += C / 60; // 요리 시간의 시를 현재 시각에 더함
        B += C % 60; // 요리 시간의 분을 현재 시각에 더함

        if(B >= 60) {
            A += B / 60; // 분이 60 이상이면 시에 추가
            B = B % 60; // 분을 60으로 나눈 나머지로 설정
        }
        if(A >= 24) {
            A -= 24; // 시가 24 이상이면 0으로 초기화
        }

        sb.append(A).append(" ").append(B);
        // 결과 출력
        System.out.print(sb);
    }
}
